//EAD703XX  JOB 'EXECOB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//********************************************************************
//* EXECUTAR PROGRAMA EAD703XX                                       *
//********************************************************************
//EXECUTA  EXEC PGM=EAD703XX
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR
